insert into student values ('1912345', '1111', '눈송이', 1, '컴퓨터과학부', 0);

insert into professor values ('30303','1111', '심준호','컴퓨터과학부');
insert into professor values ('33333','1111','박숙영','컴퓨터과학부');
insert into professor values ('34343','1111','김주균','컴퓨터과학부');
insert into professor values ('32353','1111', '박영훈' ,'컴퓨터과학부');
insert into professor values ('35555','1111','김교양','기초교양대학');


--2019년 2학기
insert into course values ('C1234','데이터베이스프로그래밍', 2019, 2, '30303',3,1,'컴퓨터과학부', 1,3,2,2,30,29);
insert into course values ('C1234','데이터베이스프로그래밍', 2019, 2, '30303',3,2,'컴퓨터과학부', 2,4,3,3,30,29);
insert into course values ('C1256','시스템종합설계', 2019, 2, '33333',3,1,'컴퓨터과학부', 1,3,1,2,30,29);
insert into course values ('C1278','자료구조', 2019, 2, '33333',3,1,'컴퓨터과학부', 2,4,2,2,30,20);
insert into course values ('C1277','운영체제', 2019, 2, '34343',3,1,'컴퓨터과학부', 2,4,1,1,30,20);
insert into course values ('C2134','글쓰기와 읽기', 2019, 2, '35555',2,1,'기초교양대학', 1,3,1,1,30,20);
insert into course values ('C2234','발표와 토론', 2019, 2, '35555',2,1,'기초교양대학', 1,3,3,3,30,30);
insert into course values ('C2456','영어쓰기와 읽기', 2019, 2, '35555',3,1,'기초교양대학', 1,3,5,5,30,20);
insert into course values ('C2567','영어발표와 토론', 2019, 2, '35555',3,1,'기초교양대학', 1,3,6,6,30,20);
insert into course values ('C1245','컴파일러', 2019, 2, '32353',3,1, '컴퓨터과학부', 2, 4, 4, 4, 30, 20);

--2019년 1학기
insert into course values ('C2134','글쓰기와 읽기', 2019, 1, '35555',2,1,'기초교양대학', 2,4,1,1,30,20);
insert into course values ('C2234','발표와 토론', 2019, 1, '35555',2,1,'기초교양대학', 2,4,3,3,30,20);
insert into course values ('C2456','영어쓰기와 읽기', 2019, 1, '35555',3,1,'기초교양대학', 2,4,5,5,30,20);
insert into course values ('C2567','영어발표와 토론', 2019, 1, '35555',3,1,'기초교양대학', 2,4,6,6,30,20);

--2018년 2학기
insert into course values ('C2134','글쓰기와 읽기', 2018, 2, '35555',2,1,'기초교양대학', 1,3,6,3,30,20);
insert into course values ('C2234','발표와 토론', 2018, 2, '35555',2,1,'기초교양대학', 1,3,5,4,30,20);
insert into course values ('C2456','영어쓰기와 읽기', 2018, 2, '35555',3,1,'기초교양대학', 1,3,4,5,30,20);
insert into course values ('C2567','영어발표와 토론', 2018, 2, '35555',3,1,'기초교양대학', 1,3,3,6,30,20);

--2018년 1학기
insert into course values ('C2134','글쓰기와 읽기', 2018, 1, '35555',2,1,'기초교양대학', 2,4,2,1,30,20);
insert into course values ('C2234','발표와 토론', 2018, 1, '35555',2,1,'기초교양대학', 2,4,3,3,30,20);
insert into course values ('C2456','영어쓰기와 읽기', 2018, 1, '35555',3,1,'기초교양대학', 1,3,4,5,30,20);
insert into course values ('C2567','영어발표와 토론', 2018, 1, '35555',3,1,'기초교양대학', 1,3,5,6,30,20);
